Repository: mahmoud40/booking_app
Catalog: lib/l10n/app_*.arb
Languages: ar_eg

# appTitle
source: ProPitch Booking
ar_eg: حجز الملاعب

source: Main Stadium
ar_eg: الملعب الرئيسي

# pleaseFillAllFields
source: Please fill in all fields
ar_eg: يرجى ملء جميع الحقول

# userExists
source: Phone or Username already exists
ar_eg: رقم الهاتف أو اسم المستخدم موجود بالفعل

# invalidCredentials
source: Invalid phone or password
ar_eg: رقم الهاتف أو كلمة المرور غير صحيحة

# errorOccurred
source: Error: {error}
ar_eg: خطأ: {error}

source: Create Account
ar_eg: إنشاء حساب

source: Welcome Back
ar_eg: أهلاً بك مجدداً

# joinCommunity
source: Join the stadium community
ar_eg: انضم إلى مجتمع الملعب

# signInPrompt
source: Sign in using your phone
ar_eg: سجل الدخول باستخدام رقم هاتفك

source: Username
ar_eg: اسم المستخدم

source: Phone Number
ar_eg: رقم الهاتف

# phoneHint
source: e.g. 0123456789
ar_eg: مثال: 01012345678

source: Password
ar_eg: كلمة المرور

source: Sign Up
ar_eg: إنشاء حساب

source: Sign In
ar_eg: تسجيل الدخول

# alreadyHaveAccount
source: Already have an account? Sign In
ar_eg: لديك حساب بالفعل؟ تسجيل الدخول

# noAccount
source: Don't have an account? Sign Up
ar_eg: ليس لديك حساب؟ إنشاء حساب

source: Continue as Guest
ar_eg: الاستمرار كضيف

# loginToBook
source: Please login to book a slot
ar_eg: يرجى تسجيل الدخول لحجز موعد

# operationsInfo
source: Select an available slot to book your match. Operations start at 3:00 PM daily.
ar_eg: اختر موعداً متاحاً لحجز مباراتك. يبدأ التشغيل يومياً من الساعة 3:00 مساءً.

source: Tap to cancel
ar_eg: اضغط للإلغاء

source: Available
ar_eg: متاح

# bookSlot
source: Book {time}
ar_eg: حجز {time}

source: Team Name
ar_eg: اسم الفريق

source: Repeat Weekly
ar_eg: تكرار أسبوعي

# weeksLabel
source: Weeks:
ar_eg: عدد الأسابيع:

# weeksCount
source: {weeks} weeks
ar_eg: {weeks} أسابيع

source: Cancel
ar_eg: إلغاء

source: Confirm
ar_eg: تأكيد

# allDatesTaken
source: All selected dates are already taken.
ar_eg: جميع الأيام المختارة محجوزة بالفعل.

# bookingConfirmed
source: Booking confirmed for {count} slots.
ar_eg: تم تأكيد الحجز لـ {count} مواعيد.

# skippedDates
source: Skipped taken dates: {dates}
ar_eg: تم تخطي الأيام المحجوزة: {dates}

# cancelBookingTitle
source: Cancel Booking?
ar_eg: إلغاء الحجز؟

# cancelBookingMessage
source: Are you sure you want to cancel the booking for {teamName} at {time}?
ar_eg: هل أنت متأكد من إلغاء حجز فريق {teamName} في {time}؟

source: No
ar_eg: لا

source: Yes, Cancel
ar_eg: نعم، إلغاء

# bookingCancelled
source: Booking cancelled successfully
ar_eg: تم إلغاء الحجز بنجاح

# supportCall
source: For support or announcements, call: 01112143221
ar_eg: للدعم أو الاستفسارات، اتصل على: 01023783968

source: Weekly Matrix Report
ar_eg: تقرير المصفوفة الأسبوعي

# dayLabel
source: DAY
ar_eg: اليوم

source: No phone
ar_eg: لا يوجد هاتف

# deleteBookingTitle
source: Delete Booking?
ar_eg: حذف الحجز؟

# deleteBookingMessage
source: Remove {teamName} at {time}?
ar_eg: هل تريد حذف حجز {teamName} في {time}؟

source: Delete
ar_eg: حذف

# pendingStatus
source: Pending
ar_eg: قيد الانتظار

source: Booking request sent
ar_eg: تم إرسال طلب الحجز

# adminRequests
source: Booking Requests
ar_eg: طلبات الحجز

source: Approve
ar_eg: قبول

source: Reject
ar_eg: رفض

source: No pending requests
ar_eg: لا توجد طلبات معلقة

source: Manage Booking
ar_eg: إدارة الحجز

# cancelBookingWarning
source: Are you sure you want to delete this booking?
ar_eg: هل أنت متأكد من حذف هذا الحجز؟

source: Close
ar_eg: إغلاق

source: Pending Request
ar_eg: طلب معلق

# adminRequestReviewMessage
source: Review this booking request. You can approve or reject it.
ar_eg: راجع طلب الحجز هذا. يمكنك قبوله أو رفضه.
